// Задание:
// 1. Создать функцию 'encode', которая будет принимать строку с буквами, необходимо возвращать с функции строку, где гласные буквы заменить на цыфры
// console.log(encode('hello'));

// 2. Создать вторую функцию 'decode', для возврата зашифрованой строки обратно
// console.log(decode(encode('hello')));

// ============================================

// Мое решение №2

function encode(str) {
  // Сторюєм масив з голосними буквами
  const arr = ["a", "e", "i", "o", "u"];

  return str
    .split("")
    .map((elem) => {
      let index = arr.indexOf(elem);
      return index !== -1 ? index + 1 : elem;
    })
    .join("");
}

// 1. Робиваєм строку на масив побуквенно
// 2. Перебираєм масив через map
// 3. Провіряєм кожний елемент на наявність в масиві голосних букв
// 4. Робимо порівняння: якщо бува є, то +1 до індексу. Якщо немає,
// то повертаємо букву
// 5. Збираєм масив в строку без ком



function decode(str) {
   // Сторюєм об'єкт, де ключі = буквам в слові
   const obj = {'1': 'a', '2': 'e', '3': 'i', '4': 'o', '5': 'u'};

   return str
     .split("")
     .map((elem) => {
       return obj[elem] ? obj[elem] : elem;
     })
     .join("");
}

// 1. Робиваєм строку на масив побуквенно
// 2. Перебираєм масив через map
// 3. Провіряєм кожний елемент на наявність в об'єкті ключа по елементу
// 4. Якщо існує, то повертаєм властивіть цього об'єкту. Якщо ні то повертаєм елемент
// 5. Збираєм масив в строку без ком


console.log("Solution #2");
console.log(encode("hello"));
console.log(decode(encode("hello")));
